OpenFOAM/simpleFsi-OF3.0.0/cases/main-les-short/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    channel
    {
        type            calculated;
        value           nonuniform List<scalar> 
554
(
5.450868
5.450868
5.450868
5.450868
5.450868
5.450868
5.450868
5.450868
...
)
;
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
0.1690668
0.169068
0.1690691
0.1690674
0.1690728
0.169073
0.1690719
0.1690704
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
